Repository: rffontenelle/r-datatable-pt_br
Catalog: */assign.po
Languages: pt_br

source: Internal error: finalizer hasn't received an ExternalPtr
pt_br: Erro interno: finalizador não recebeu um ExternalPtr

source: Internal error: finalizer's ExternalPtr doesn't see names in tag
pt_br: Erro interno: ExternalPtr do finalizador não vê nomes na tag

source: Internal error: finalizer sees l=%d, tl=%d
pt_br: Erro interno: finalizador vê l=%d, tl=%d

source: .internal.selfref ptr is NULL. This is expected and normal for a data.table loaded from disk. Please remember to always setDT() immediately after loading to prevent unexpected behavior. If this table was not loaded from disk or you've already run setDT(), please report to data.table issue tracker.
pt_br: ptr de .internal.selfref é NULL. Isso é esperado e normal para um data.table carregado do disco. Lembre-se de sempre executar setDT() imediatamente após o carregamento para evitar comportamento inesperado. Se esta tabela não foi carregada do disco ou você já executou setDT(), informe ao rastreador de problemas do data.table.

source: Internal error: .internal.selfref ptr is neither NULL nor R_NilValue
pt_br: Erro interno: ptr de .internal.selfref não é NULL nem R_NilValue

source: Internal error: .internal.selfref tag is neither NULL nor a character vector
pt_br: Erro interno: tag de .internal.selfref não é NULL nem um vetor de caracteres

source: Internal error: length(names)>0 but <length(dt)
pt_br: Erro interno: length(names)>0, mas <length(dt)

source: alloccol has been passed a NULL dt
pt_br: alloccol recebeu um dt NULL

source: dt passed to alloccol isn't type VECSXP
pt_br: dt passado para alloccol não é do tipo VECSXP

source: dt passed to alloccol has no class attribute. Please report result of traceback() to data.table issue tracker.
pt_br: dt passado para alloccol não possui nenhum atributo de classe. Por favor, relate o resultado de traceback() para o rastreador de problemas do data.table.

source: Internal error: length of names (%d) is not length of dt (%d)
pt_br: Erro interno: o comprimento dos nomes (%d) não é tem o comprimento de dt (%d)

source: Internal error, tl of class is marked but tl<0.
pt_br: Erro interno, tl da classe está marcado, mas tl<0.

source: Internal error, please report (including result of sessionInfo()) to data.table issue tracker: tl (%d) < l (%d) but tl of class is marked.
pt_br: Erro interno, relate (incluindo o resultado de sessionInfo()) ao rastreador de problemas data.table: tl (%d) < l (%d), mas tl da classe está marcado.

source: tl (%d) is greater than 10,000 items over-allocated (l = %d). If you didn't set the datatable.alloccol option to be very large, please report to data.table issue tracker including the result of sessionInfo().
pt_br: tl (%d) é superior a 10.000 itens superalocados (l = %d). Se você não definiu a opção datatable.alloccol como muito grande, relate ao rastreador de problemas do data.table incluindo o resultado de sessionInfo().

source: Attempt to reduce allocation from %d to %d ignored. Can only increase allocation via shallow copy. Please do not use DT[...]<- or DT$someCol<-. Use := inside DT[...] instead.
pt_br: Tentativa de reduzir a alocação de %d para %d foi ignorada. Só é possível aumentar a alocação por meio de cópia rasa. Por favor, não use DT[...]<- ou DT$someCol<-. Use := dentro de DT[...] em vez disso.

source: Has getOption('datatable.alloccol') somehow become unset? It should be a number, by default 1024.
pt_br: GetOption('datatable.alloccol') de alguma forma deixou de estar definido? Deveria ser um número, por padrão 1024.

source: getOption('datatable.alloccol') should be a number, by default 1024. But its type is '%s'.
pt_br: getOption('datatable.alloccol') deveria ser um número, por padrão 1024. Mas seu tipo é "%s".

source: getOption('datatable.alloc') is a numeric vector ok but its length is %d. Its length should be 1.
pt_br: getOption('datatable.alloc') é um vetor numérico, mas seu comprimento é %d. Seu comprimento deve ser 1.

source: getOption('datatable.alloc')==%d. It must be >=0 and not NA.
pt_br: getOption('datatable.alloc')==%d. Deve ser >=0 e não NA.

source: %s must be TRUE or FALSE
pt_br: %s deve ser TRUE ou FALSE

source: assign has been passed a NULL dt
pt_br: à atribuição foi passado um dt NULL

source: dt passed to assign isn't type VECSXP
pt_br: dt passado para a atribuição não é do tipo VECSXP

source: .SD is locked. Updating .SD by reference using := or set are reserved for future use. Use := in j directly. Or use copy(.SD) as a (slow) last resort, until shallow() is exported.
pt_br: .SD está bloqueado. A atualização de .SD por referência usando := ou set está reservada para uso futuro. Use := em j diretamente. Ou use copy(.SD) como um como último recurso (lento), até que shallow() seja exportado.

source: Internal error: dt passed to Cassign is not a data.table or data.frame
pt_br: Erro interno: dt passado para Cassign não é data.table ou data.frame

source: dt passed to assign has no names
pt_br: dt passado para assign não tem nomes

source: data.table is NULL; malformed. A null data.table should be an empty list. typeof() should always return 'list' for data.table.
pt_br: data.table é NULL; malformado. Um data.table nulo deve ser uma lista vazia. typeof() deve sempre retornar "list" para data.table.

source: Assigning to all %d rows
pt_br: Atribuindo a todas as %d linhas

source: Coerced i from numeric to integer. Please pass integer for efficiency; e.g., 2L rather than 2
pt_br: Foi feita coerção de i de numérico para inteiro. Por favor, passe um número inteiro para obter eficiência; por exemplo, 2L em vez de 2

source: i is type '%s'. Must be integer, or numeric is coerced with warning. If i is a logical subset, simply wrap with which(), and take the which() outside the loop if possible for efficiency.
pt_br: i é do tipo '%s'. Deve ser inteiro ou é feita coerção de numérico com aviso. Se i for um subconjunto lógico, simplesmente envolva which() e obtenha which() por fora do loop, se possível, para maior eficiência.

source: i[%d] is %d which is out of range [1,nrow=%d]
pt_br: i[%d] é %d, o qual está fora do intevalo [1,nrow=%d]

source: Assigning to %d row subset of %d rows
pt_br: Atribuindo para a linha %d que é subconjunto de %d linhas

source: Added %d new column%s initialized with all-NA
pt_br: Adicionada(s) %d nova(s) coluna%s inicializada toda com NA

source: length(LHS)==0; no columns to delete or assign RHS to.
pt_br: length(LHS)==0; nenhuma coluna para excluir ou atribuir RHS.

source: set() on a data.frame is for changing existing columns, not adding new ones. Please use a data.table for that. data.table's are over-allocated and don't shallow copy.
pt_br: set() em um data.frame serve para alterar colunas existentes, não para adicionar novas. Por favor, use um data.table para isso. data.table são superalocados e não são copiados superficialmente.

source: Coerced j from numeric to integer. Please pass integer for efficiency; e.g., 2L rather than 2
pt_br: Foi feita coerção do j de numérico para inteiro. Por favor, passe um número inteiro obter eficiência; por exemplo, 2L em vez de 2

source: j is type '%s'. Must be integer, character, or numeric is coerced with warning.
pt_br: j é do tipo "%s". Deve ser inteiro, caractere ou numérico é coagido com aviso.

source: Can't assign to the same column twice in the same query (duplicates detected).
pt_br: Não é possível atribuir à mesma coluna duas vezes na mesma consulta (duplicatas detectadas).

source: newcolnames is supplied but isn't a character vector
pt_br: newcolnames é fornecido, mas não é um vetor de caracteres

source: RHS_list_of_columns revised to true because RHS list has 1 item which is NULL, or whose length %d is either 1 or targetlen (%d). Please unwrap RHS.
pt_br: RHS_list_of_columns revisado para true porque a lista no lado direito (RHS) tem 1 item que é NULL ou cujo comprimento %d é 1 ou targetlen (%d). Por favor, desembrulhe o lado direito.

source: Supplied %d columns to be assigned an empty list (which may be an empty data.table or data.frame since they are lists too). To delete multiple columns use NULL instead. To add multiple empty list columns, use list(list()).
pt_br: %d colunas fornecidas para serem atribuídas a uma lista vazia (que pode ser um data.table ou data.frame vazio, pois também são listas). Para excluir várias colunas, use NULL. Para adicionar várias colunas de lista vazias, use list(list()).

source: Recycling single RHS list item across %d columns. Please unwrap RHS.
pt_br: Reciclando um único item da lista lado direito (RHS) em %d colunas. Por favor, desembrulhe o lado direito.

source: Supplied %d columns to be assigned %d items. Please see NEWS for v1.12.2.
pt_br: Fornecidas %d colunas para serem atribuídos %d itens. Por favor, veja NEWS para v1.12.2.

source: Item %d of column numbers in j is %d which is outside range [1,ncol=%d]. set() on a data.frame is for changing existing columns, not adding new ones. Please use a data.table for that.
pt_br: Item %d da coluna números em j é %d, o que está fora da faixa [1,ncol=%d]. set() em um data.frame é para alterar colunas existentes, não para adicionar novas. Por favor, use um data.table para isso.

source: Item %d of column numbers in j is %d which is outside range [1,ncol=%d]. Use column names instead in j to add new columns.
pt_br: Item %d da coluna números em j é %d, o que está fora da faixa [1,ncol=%d]. Use nomes de coluna em vez disso em j para adicionar novas colunas.

source: When deleting columns, i should not be provided
pt_br: Ao excluir colunas, i não deve ser fornecido

source: RHS of assignment to existing column '%s' is zero length but not NULL. If you intend to delete the column use NULL. Otherwise, the RHS must have length > 0; e.g., NA_integer_. If you are trying to change the column type to be an empty list column then, as with all column type changes, provide a full length RHS vector such as vector('list',nrow(DT)); i.e., 'plonk' in the new column.
pt_br: O lado direito (RHS) da atribuição à coluna existente '%s' tem comprimento zero, mas não é NULL. Se você pretende excluir a coluna, use NULL. Caso contrário, o lado direito (RHS) deverá ter comprimento > 0; por exemplo, NA_integer_. Se você estiver tentando alterar o tipo de coluna para uma coluna de lista vazia, como acontece com todas as alterações de tipo de coluna, forneça no lado direito (RHS) um vetor de comprimento completo, como vector('list',nrow(DT)); ou seja, 'plonk' na nova coluna.

source: Internal error in assign.c: length(newcolnames)=%d, length(names)=%d, coln=%d
pt_br: Erro interno em assign.c: length(newcolnames)=%d, length(names)=%d, coln=%d

source: Column '%s' does not exist to remove
pt_br: A coluna '%s' não existe para ser removida

source: %d column matrix RHS of := will be treated as one vector
pt_br: Coluna %d da matriz do lado direito (RHS) de := será tratada como um vetor

source: Can't assign to column '%s' (type 'factor') a value of type '%s' (not character, factor, integer or numeric)
pt_br: Não é possível atribuir para a coluna '%s' (tipo 'factor') um valor de tipo '%s' (não um caractere, fator, inteiro ou numérico)

source: Supplied %d items to be assigned to %d items of column '%s'. If you wish to 'recycle' the RHS please use rep() to make this intent clear to readers of your code.
pt_br: Fornecidos %d itens a serem atribuídos a %d itens da coluna '%s'. Se você deseja fazer 'recycle' o lado direito (RHS), use rep() para deixar essa intenção clara para os leitores do seu código.

source: This data.table has either been loaded from disk (e.g. using readRDS()/load()) or constructed manually (e.g. using structure()). Please run setDT() or setalloccol() on it first (to pre-allocate space for new columns) before assigning by reference to it.
pt_br: Este data.table foi carregado do disco (por exemplo, usando readRDS()/load()) ou construído manualmente (por exemplo, usando Structure()). Execute setDT() ou setalloccol() nele primeiro (para pré-alocar espaço para novas colunas) antes de atribuir por referência a ele.

source: Internal error: oldtncol(%d) < oldncol(%d). Please report to data.table issue tracker, including result of sessionInfo().
pt_br: Erro interno: oldncol(%d) < oldncol(%d). Por favor, relate ao rastreador de problemas do data.table, incluindo o resultado de sessionInfo().

source: truelength (%d) is greater than 10,000 items over-allocated (length = %d). See ?truelength. If you didn't set the datatable.alloccol option very large, please report to data.table issue tracker including the result of sessionInfo().
pt_br: truelength (%d) é maior que 10.000 itens superalocados (length = %d). Consulte ?truelength. Se você não definiu a opção datatable.alloccol muito grande, relate no rastreador de problemas do data.table incluindo o resultado de sessionInfo().

source: Internal error: DT passed to assign has not been allocated enough column slots. l=%d, tl=%d, adding %d
pt_br: Erro interno: O DT passado para atribuição não recebeu slots de coluna suficientes. l=%d, tl=%d, adicionando %d

source: It appears that at some earlier point, names of this data.table have been reassigned. Please ensure to use setnames() rather than names<- or colnames<-. Otherwise, please report to data.table issue tracker.
pt_br: Parece que em algum momento anterior, os nomes desta data.table foram reatribuídos. Certifique-se de usar setnames() em vez de names<- ou colnames<-. Caso contrário, informe no rastreador de problemas do data.table.

source: Internal error: selfrefnames is ok but tl names [%lld] != tl [%d]
pt_br: Erro interno: selfrefnames está certo, mas names de tl [%lld] != tl [%d]

source: Internal error: earlier error 'When deleting columns, i should not be provided' did not happen.
pt_br: Erro interno: o erro anterior 'Ao excluir colunas, i não deve ser fornecido' não ocorreu.

source: RHS for item %d has been duplicated because NAMED==%d MAYBE_SHARED==%d, but then is being plonked. length(values)==%d; length(cols)==%d)
pt_br: O lado direito (RHS) para o item %d foi duplicado porque NAMED==%d MAYBE_SHARED==%d, mas depois está sendo plonked. length(values)==%d; length(cols)==%d)

source: Direct plonk of unnamed RHS, no copy. NAMED==%d, MAYBE_SHARED==%d
pt_br: Plonk direto de lado direito (RHS) sem nome, sem cópia. NAMED==%d, MAYBE_SHARED==%d

source: Dropping index '%s' as it doesn't have '__' at the beginning of its name. It was very likely created by v1.9.4 of data.table.
pt_br: Descartando o índice "%s" porque ele não tem "__" no início do nome. Muito provavelmente foi criado pela versão 1.9.4 do data.table.

source: Internal error: index name ends with trailing __
pt_br: Erro interno: o nome do índice termina com __ à direita

source: Internal error: Couldn't allocate memory for s4.
pt_br: Erro interno: não foi possível alocar memória para s4.

source: Internal error: Couldn't allocate memory for s5.
pt_br: Erro interno: não foi possível alocar memória para s5.

source: Dropping index '%s' due to an update on a key column
pt_br: Descartando o índice "%s" devido a uma atualização em uma coluna-chave

source: Shortening index '%s' to '%s' due to an update on a key column
pt_br: Reduzindo o índice "%s" para "%s" devido a uma atualização em uma coluna-chave

source: Internal error: %d column numbers to delete not now in strictly increasing order. No-dups were checked earlier.
pt_br: Erro interno: %d números de coluna a serem excluídos agora não estão em ordem rigorosamente crescente. Verificação de não duplicata foi feita anteriormente.

source: Internal error memrecycle: sourceStart=%d sourceLen=%d length(source)=%d
pt_br: Erro interno de memrecycle: sourceStart=%d sourceLen=%d length(source)=%d

source: Internal error memrecycle: start=%d len=%d length(target)=%d
pt_br: Erro interno de memrecycle: start=%d len=%d length(target)=%d

source: Internal error: memrecycle has received NULL colname
pt_br: Erro interno: memrecycle recebeu nome de coluna NULL

source: Cannot assign 'factor' to '%s'. Factors can only be assigned to factor, character or list columns.
pt_br: Não é possível atribuir "factor" a "%s". Os fatores só podem ser atribuídos a colunas de fator, caractere ou lista.

source: Cannot assign '%s' to 'factor'. Factor columns can be assigned factor, character, NA in any type, or level numbers.
pt_br: Não é possível atribuir "%s" a "factor". As colunas de fator podem receber fator, caractere, NA em qualquer tipo ou números de nível.

source: Internal error: levels of target are either not unique or have truelength<0
pt_br: Erro interno: os níveis de destino não são exclusivos ou têm truelength<0

source: Internal error: extra level check sum failed
pt_br: Erro interno: falha na soma de verificação de nível extra

source: type '%s' cannot be coerced to '%s'
pt_br: o tipo "%s" não pode ser coagido para "%s"

source: Unsupported column type in assign.c:memrecycle '%s'
pt_br: Tipo de coluna não suportado em assign.c:memrecycle "%s"
