Repository: rffontenelle/r-datatable-pt_br
Catalog: */bmerge.po
Languages: pt_br

source: Internal error: icols is not integer vector
pt_br: Erro interno: icols não é um vetor de inteiros

source: Internal error: xcols is not integer vector
pt_br: Erro interno: xcols não é um vetor de inteiros

source: Internal error: icols and xcols must be non-empty integer vectors.
pt_br: Erro interno: icols e xcols devem ser vetores não vazios de inteiros

source: Internal error: length(icols) [%d] > length(xcols) [%d]
pt_br: Erro interno: length(icols) [%d] > length(xcols) [%d]

source: Internal error. icols[%d] is NA
pt_br: Erro interno. icols[%d] é NA

source: Internal error. xcols[%d] is NA
pt_br: Erro interno. xcols[%d] é NA

source: icols[%d]=%d outside range [1,length(i)=%d]
pt_br: icols[%d]=%d fora do intervalo [1,length(i)=%d]

source: xcols[%d]=%d outside range [1,length(x)=%d]
pt_br: xcols[%d]=%d fora do intervalo [1,length(i)=%d]

source: Type '%s' is not supported for joining/merging
pt_br: Sem suporte ao tipo '%s' para junção/combinação

source: roll is character but not 'nearest'
pt_br: roll é caractere, mas não é 'nearest'

source: roll='nearest' can't be applied to a character column, yet.
pt_br: roll='nearest' ainda não pode ser aplicado a uma coluna de caracteres.

source: Internal error: roll is not character or double
pt_br: Erro interno: roll não é caractere ou double

source: rollends must be a length 2 logical vector
pt_br: rollends deve ser um vetor lógico de comprimento 2

source: Internal error: nomatchArg must be NULL or length-1 logical/integer
pt_br: Erro interno: nomatchArg deve ser NULL ou inteiro/lógico de comprimento 1

source: Internal error: nomatchArg must be NULL, NA, NA_integer_ or 0L
pt_br: Erro interno: nomatchArg deve ser NULL, NA, NA_integer_ ou 0L

source: Internal error: invalid value for 'mult'. please report to data.table issue tracker
pt_br: Erro interno: valor inválido para 'mult'. Por favor, relate isso no rastreador de problemas do data.table

source: Internal error: opArg is not an integer vector of length equal to length(on)
pt_br: Erro interno: opArg não é um vetor de inteiros de comprimento igual a length(on)

source: Internal error in bmerge_r for x.'%s'. Unrecognized value op[col]=%d
pt_br: Erro interno em bmerge_r para x.'%s'. Valor não reconhecido op[col]=%d

source: Only '==' operator is supported for columns of type character.
pt_br: Só há suporte ao operador '==' para colunas do tipo caractere.

source: Internal error: nqgrpArg must be an integer vector
pt_br: Erro interno: nqgrpArg deve ser um vetor de inteiros

source: Intrnal error: nqmaxgrpArg is not a positive length-1 integer vector
pt_br: Erro interno: nqmaxgrpArg não é um vetor de inteiros positivos de comprimento 1

source: Internal error in allocating memory for non-equi join
pt_br: Erro interno na alocação de memória para junção não equivalente

source: Internal error: xoArg is not an integer vector
pt_br: Erro interno: xoArg não é um vetor de inteiros
