Repository: rffontenelle/r-datatable-pt_br
Catalog: */frollR.po
Languages: pt_br

source: x must be of type numeric or logical, or a list, data.frame or data.table of such
pt_br: x deve ser do tipo numérico ou lógico, ou uma lista, data.frame ou data.table com colunas assim

source: n must be non 0 length
pt_br: n deve ser de comprimento não 0

source: %s must be TRUE or FALSE
pt_br: %s deve ser TRUE ou FALSE

source: n must be integer, list is accepted for adaptive TRUE
pt_br: n deve ser inteiro, lista é aceita para 'adaptative' TRUE

source: n must be integer
pt_br: n deve ser inteiro

source: n must be positive integer values (> 0)
pt_br: n deve ter valores inteiros positivos (> 0)

source: n must be integer vector or list of integer vectors
pt_br: n deve ser um vetor de inteiros ou uma lista de vetores de inteiros

source: hasNA must be TRUE, FALSE or NA
pt_br: hasNA deve ser TRUE, FALSE ou NA

source: using hasNA FALSE and na.rm TRUE does not make sense, if you know there are NA values use hasNA TRUE, otherwise leave it as default NA
pt_br: usando hasNA FALSE e na.rm TRUE não faz sentido, se vocês sabe que há valores NA use hasNA TRUE, ou então deixe com o padrão NA

source: Internal error: invalid %s argument in %s function should have been caught earlier. Please report to the data.table issue tracker.
pt_br: Erro interno: argumento %s inválido na função %s deveria ter sido capturado antes. Favor relater para o rastreador de problemas do data.table.

source: using adaptive TRUE and align argument different than 'right' is not implemented
pt_br: usar adaptative TRUE e argumento align diferente de 'right' não está implementado

source: %s: allocating memory for results %dx%d
pt_br: %s: alocando memória para resultados %dx%d

source: adaptive rolling function can only process 'x' having equal length of elements, like data.table or data.frame; If you want to call rolling function on list having variable length of elements call it for each field separately
pt_br: A função móvel adaptativa só pode processar 'x' com elementos de igual comprimento, como data.table ou data.frame. Se você quiser chamar uma função móvel em uma lista com elementos de comprimento variável, chame-a para cada elemento separadamente

source: length of integer vector(s) provided as list to 'n' argument must be equal to number of observations provided in 'x'
pt_br: comprimento dos vetor(es) de inteiros fornecidos como lista para argumento 'n' deve ser igual ao número de observações fornecidas em 'x'

source: fill must be a vector of length 1
pt_br: fill deve ser um vetor de comprimento 1

source: fill must be numeric or logical
pt_br: fill deve ser numérico ou lógico

source: Internal error: badaptive=%d but ik is not integer
pt_br: Erro interno: badaptative=%d mas sei que não é inteiro

source: %s: %d column(s) and %d window(s), if product > 1 then entering parallel execution
pt_br: %s: %d coluna(s) e %d janela(s), se produto > 1 então entrando em execução paralela

source: %s: %d column(s) and %d window(s), not entering parallel execution here because algo='exact' will compute results in parallel
pt_br: %s: coluna(s) e %d janela(s), não entrando em execução paralela aqui porque algo='exact' vai computar os resultados em paralelo

source: Internal error: Unknown sfun value in froll: %d
pt_br: Erro interno: valor sfun desconhecido em froll: %d

source: %s: processing of %d column(s) and %d window(s) took %.3fs
pt_br: %s: processamento de %d coluna(s) e %d janela(s) levou %.3fs

source: internal error: 'fun' must be a function
pt_br: erro interno: 'fun' deve ser uma função

source: internal error: 'rho' should be an environment
pt_br: erro interno: 'rho' deve ser um ambiente
