Repository: rffontenelle/r-datatable-pt_br
Catalog: */froll.po
Languages: pt_br

source: %s: window width longer than input vector, returning all NA vector
pt_br: %s: largura da janela maior do que o vetor de entrada, retornando vetor todo NA

source: %s: align %d, shift answer by %d
pt_br: %s: align %d, deslocar resposta por %d

source: %s: processing algo %u took %.3fs
pt_br: %s: processar algo %u levou %.3fs

source: %s: running for input length %<PRIu64>, window %d, hasna %d, narm %d
pt_br: %s: rodando para entrada de comprimento %<PRIu64>, janela %d, hasna %d, narm %d

source: %s: hasNA=FALSE used but NA (or other non-finite) value(s) are present in input, use default hasNA=NA to avoid this warning
pt_br: %s: hasNA=FALSE usado mas valor(es) NA (ou outros não finitos) estão presentes na entrada, use o padrão hasNA=NA para evitar este aviso

source: %s: NA (or other non-finite) value(s) are present in input, re-running with extra care for NAs
pt_br: %s: valor(es) NA (ou outros não finitos) estão presentes na entrada, rodando de novo com cuidado extra com NAs

source: %s: NA (or other non-finite) value(s) are present in input, skip non-NA attempt and run with extra care for NAs
pt_br: %s: valor(es) NA (ou outros não finitos) estão presentes na entrada, pular tentativa não-NA e rodar como cuidado extra para NAs

source: %s: running in parallel for input length %<PRIu64>, window %d, hasna %d, narm %d
pt_br: %s: rodando em paralelo para entrada de largura %<PRIu64>, janela %d, hasna %d, narm %d

source: %s: NA (or other non-finite) value(s) are present in input, na.rm was FALSE so in 'exact' implementation NAs were handled already, no need to re-run
pt_br: %s: valor(es) NA (ou outros não finitos) estão presentes na entrada, na.rm era FALSE então a implementação 'exact' já lidou com os NAs, sem necessidade de rodar de novo

source: %s: results from provided FUN are not length 1
pt_br: %s: resultados da FUN fornecida não são de comprimento 1
