Repository: rffontenelle/r-datatable-pt_br
Catalog: */fwrite.po
Languages: pt_br

source: buffMB=%d outside [1,1024]
pt_br: buffMB=%d fora do intervalo [1,1024]

source: eol must be 1 or more bytes (usually either \n or \r\n) but is length %d
pt_br: eol deve ter 1 ou mais bytes (geralmente \n ou \r\n), mas tem comprimento %d

source: Column writers:
pt_br: Colunas de escritores:

source: Internal error: type %d has no max length method implemented
pt_br: Erro interno: tipo %d não tem método de comprimento máximo implementado

source: maxLineLen=%<PRIu64>. Found in %.3fs
pt_br: maxLineLen=%<PRIu64>. Encontrado em %.3fs

source: %s: '%s'. Failed to open existing file for writing. Do you have write permission to it? Is this Windows and does another process such as Excel have it open?
pt_br: %s: '%s'. Falha ao abrir o arquivo existente para escrita. Você tem permissão de escrita? Se estiver usando Windows, outro processo, como o Excel, pode estar com o arquivo aberto?

source: %s: '%s'. Unable to create new file for writing (it does not exist already). Do you have permission to write here, is there space on the disk and does the path exist?
pt_br: %s: '%s'. Não foi possível criar um novo arquivo para escrita (ele ainda não existe). Você tem permissão para escrever aqui, há espaço no disco e o caminho existe?

source: Compression in fwrite uses zlib library. Its header files were not found at the time data.table was compiled. To enable fwrite compression, please reinstall data.table and study the output for further guidance.
pt_br: Compressão em fwrite usa a biblioteca zlib. Seus arquivos de cabeçalho não foram encontrados no momento em que o data.table foi compilado. Para habilitar a compressão em fwrite, por favor, reinstale o data.table e estude a saída para obter mais orientações.

source: Writing bom (%s), yaml (%d characters) and column names (%s) ...
pt_br: Escrevendo bom (%s), yaml (%d caracteres) e nomes das colunas (%s) ...

source: Unable to allocate %zu MiB for header: %s
pt_br: Não foi possível alocar %zu MiB para o cabeçalho: %s

source: Can't allocate gzip stream structure
pt_br: Não é possível alocar a estrutura de fluxo gzip

source: Unable to allocate %zu MiB for zbuffer: %s
pt_br: Não foi possível alocar %zu MiB para o zbuffer: %s

source: Compress gzip error: %d
pt_br: Erro ao comprimir gzip: %d

source: done in %.3fs
pt_br: concluído em %.3fs

source: No data rows present (nrow==0)
pt_br: Nenhuma linha de dados presente (nrow==0)

source: Writing %<PRId64> rows in %d batches of %d rows (each buffer size %dMB, showProgress=%d, nth=%d)
pt_br: Escrevendo %<PRId64> linhas em %d lotes de %d linhas (cada buffer de tamanho%dMB, showProgress=%d, nth=%d)

source: zbuffSize=%d returned from deflateBound
pt_br: zbuffSize=%d retornado de deflateBound

source: Unable to allocate %zu MB * %d thread buffers; '%d: %s'. Please read ?fwrite for nThread, buffMB and verbose options.
pt_br: Não foi possível alocar %zu MB * %d buffers de thread; '%d: %s'. Por favor, leia ?fwrite para as opções nThread, buffMB e verbose.

source: Unable to allocate %zu MB * %d thread compressed buffers; '%d: %s'. Please read ?fwrite for nThread, buffMB and verbose options.
pt_br: Não foi possível alocar %zu MB * %d buffers comprimidos de thread; '%d: %s'. Por favor, leia ?fwrite para as opções nThread, buffMB e verbose.

source: zlib %s (zlib.h %s) deflate() returned error %d with z_stream->msg=="%s" Z_FINISH=%d Z_BLOCK=%d. %s
pt_br: zlib %s (zlib.h %s) deflate() retornou erro %d com z_stream->msg=="%s" Z_FINISH=%d Z_BLOCK=%d. %s

source: Please include the full output above and below this message in your data.table bug report.
pt_br: Por favor, inclua a saída completa acima e abaixo desta mensagem no seu relatório de bug do data.table.

source: Please retry fwrite() with verbose=TRUE and include the full output with your data.table bug report.
pt_br: Por favor, tente novamente fwrite() com verbose=TRUE e inclua a saída completa no seu relatório de bug do data.table.
