Repository: rffontenelle/r-datatable-pt_br
Catalog: */ijoin.po
Languages: pt_br

source: Internal error: invalid value for 'mult'; this should have been caught before. please report to data.table issue tracker
pt_br: Erro interno: valor inválido para 'mult'; isso deveria ter sido detectado antes. informe ao rastreador de problemas do data.table

source: Internal error: invalid value for 'type'; this should have been caught before. please report to data.table issue tracker
pt_br: Erro interno: valor inválido para 'type'; isso deveria ter sido detectado antes. informe ao rastreador de problemas do data.table

source: Internal error: unknown type in mult=%d in lookup: %d
pt_br: Erro interno: tipo desconhecido em mult=%d na pesquisa: %d

source: Internal error: unknown mult in lookup: %d
pt_br: Erro interno: mult desconhecido na pesquisa: %d

source: First pass on calculating lengths in lookup ... done in %8.3f seconds
pt_br: Primeira passagem no cálculo de comprimentos na pesquisa. .. realizada em %8.3f segundos

source: Second pass on allocation in lookup ... done in %8.3f seconds
pt_br: Segunda passagem na alocação na pesquisa. .. realizada em %8.3f segundos

source: Internal error: unknown type lookup should have been caught earlier: %d
pt_br: Erro interno: a pesquisa de type desconhecido deveria ter sido detectada anteriormente: %d

source: Internal error: unknown type in mult=%d in lookup should have been caught earlier: %d
pt_br: Erro interno: type desconhecido na pesquisa de mult=%d deveria ter sido detectado anteriormente: %d

source: Final step in generating lookup ... done in %8.3f seconds
pt_br: Etapa final na geração da pesquisa... realizada em %8.3f segundos

source: Internal error: unknown type in mult=ALL in overlaps: %d
pt_br: Erro interno: tipo desconhecido em mult=ALL em sobreposições: %d

source: First pass on calculating lengths in overlaps ... done in %8.3f seconds
pt_br: Primeira passagem no cálculo de comprimentos em sobreposições ... realizada em %8.3f segundos

source: Internal error: unknown type in mult=%d in overlaps: %d
pt_br: Erro interno: tipo desconhecido em mult=%d em sobreposições: %d

source: Internal error: unknown mult in overlaps: %d
pt_br: Erro interno: mult desconhecido em sobreposições: %d

source: Final step, fetching indices in overlaps ... done in %8.3f seconds
pt_br: Etapa final, busca de índices em sobreposições ... realizada em %8.3f segundos
