Repository: rffontenelle/r-datatable-pt_br
Catalog: */R-data.table.po
Languages: pt_br

source: Note that the shallow copy will assign to the environment from which := was called. That means for example that if := was called within a function, the original table may be unaffected.
pt_br: Observe que a cópia rasa será atribuída ao ambiente do qual := foi chamado. Isso significa, por exemplo, que se := foi chamado dentro de uma função, a tabela original pode não ser afetada.

source: Cannot assign to an under-allocated recursively indexed list -- L[[i]][,:=] syntax is only valid when i is length 1, but its length is %d
pt_br: Não é possível atribuir a uma lista indexada recursivamente subalocada - a sintaxe L[[i]][,:=] só é válida quando i tem comprimento 1, mas seu comprimento é %d

source: Internal error -- item '%s' not found in names of list
pt_br: Erro interno -- item '%s' não encontrado nos nomes da lista

source: Internal error -- column(s) not found: %s
pt_br: Erro interno – coluna(s) não encontrada(s): %s

source: strptime() usage detected and wrapped with as.POSIXct(). This is to minimize the chance of assigning POSIXlt columns, which use 40+ bytes to store one date (versus 8 for POSIXct). Use as.POSIXct() (which will call strptime() as needed internally) to avoid this warning.
pt_br: Uso de strptime() detectado e agrupado com as.POSIXct(). Isso minimiza a chance de atribuir colunas POSIXlt, que usam mais de 40 bytes para armazenar uma data (contra 8 para POSIXct). Use as.POSIXct() (que chamará strptime() conforme necessário internamente) para evitar esse aviso.

source: Variable '%s' is not found in calling scope. Looking in calling scope because this symbol was prefixed with .. in the j= parameter.
pt_br: A variável '%s' não foi encontrada no escopo de chamada. Procurando no escopo de chamada porque este símbolo foi prefixado com .. no parâmetro j=.

source: Internal error: xcolAns does not pass checks: %d/%d/%d/%s
pt_br: Erro interno: xcolAns não passa nas verificações: %d/%d/%d/%s

source: Internal error: irows is NULL when making join result at R level. Should no longer happen now we use CsubsetDT earlier.
pt_br: Erro interno: irows é NULL ao fazer o resultado da junção no nível R. Isso não deveria mais acontecer agora, usamos CsubsetDT anteriormente.

source: j (the 2nd argument inside [...]) is a single symbol but column name '%1$s' is not found. If you intended to select columns using a variable in calling scope, please try DT[, ..%1$s]. The .. prefix conveys one-level-up similar to a file system path.
pt_br: j (o 2º argumento dentro de [...]) é um símbolo único, mas o nome da coluna '%1$s' não foi encontrado. Se você pretendia selecionar colunas usando uma variável na chamada do escopo, tente DT[, ..%1$s]. O prefixo .. transmite um nível superior semelhante a um caminho do sistema de arquivos.

source: Internal error: j has created a data.table result containing a NULL column
pt_br: Erro interno: j criou um resultado de data.table contendo uma coluna NULL

source: The column '.N' can't be grouped because it conflicts with the special .N variable. Try setnames(DT,'.N','N') first.
pt_br: A coluna '.N' não pode ser agrupada porque entra em conflito com a variável especial .N. Tente setnames(DT,'.N','N') primeiro.

source: The column '.I' can't be grouped because it conflicts with the special .I variable. Try setnames(DT,'.I','I') first.
pt_br: A coluna '.I' não pode ser agrupada porque entra em conflito com a variável especial .I. Tente setnames(DT,'.I','I') primeiro.

source: Note: forcing units="secs" on implicit difftime by group; call difftime explicitly to choose custom units
pt_br: Nota: forçando units="secs" em difftime implícito por grupo; chame difftime explicitamente para escolher unidades personalizadas

source: logical error. i is not data.table, but mult='all' and 'by'=.EACHI
pt_br: erro lógico. i não é data.table, mas mult='all' e 'by'=.EACHI

source: Internal error: by= is missing
pt_br: Erro interno: by= está ausente

source: Finding groups using forderv ...
pt_br: Encontrando grupos usando forderv ...

source: Finding group sizes from the positions (can be avoided to save RAM) ...
pt_br: Encontrando tamanhos de grupos a partir das posições (pode ser evitado para economizar RAM) ...

source: Getting back original order ...
pt_br: Recuperando a ordem original...

source: Finding groups using uniqlist on key ...
pt_br: Encontrando grupos usando uniqlist na chave ...

source: Internal error: byindex not the index name
pt_br: Erro interno: byindex não é o nome do índice

source: Finding groups using uniqlist on index '%s' ...
pt_br: Encontrando grupos usando uniqlist no índice '%s' ...

source: Internal error: byindex not found
pt_br: Erro interno: byindex não encontrado

source: lapply optimization changed j from '%s' to '%s'
pt_br: a otimização de lapply mudou j de '%s' para '%s'

source: lapply optimization is on, j unchanged as '%s'
pt_br: a otimização de lapply está ativada, j inalterado como '%s'

source: GForce optimized j to '%s' (see ?GForce)
pt_br: GForce otimizou j para '%s' (veja ?GForce)

source: GForce is on, but not activated for this query; left j unchanged (see ?GForce)
pt_br: O GForce está ativado, mas não disponível para esta consulta; deixou j inalterado (veja ?GForce)

source: Unable to optimize call to mean() and could be very slow. You must name 'na.rm' like that otherwise if you do mean(x,TRUE) the TRUE is taken to mean 'trim' which is the 2nd argument of mean. 'trim' is not yet optimized.
pt_br: Não foi possível otimizar a chamada de mean() e pode ser muito lento. Você deve nomear 'na.rm' desta forma, caso contrário, se você usar mean(x,TRUE), o TRUE é obtido para fazer uma média truncada, pois 'trim' é o 2º argumento de mean. 'trim' ainda não está otimizado.

source: Old mean optimization changed j from '%s' to '%s'
pt_br: A otimização antiga de média mudou j de '%s' para '%s'

source: Old mean optimization is on, left j unchanged.
pt_br: A otimização antiga de média está ativada, j deixado inalterado.

source: All optimizations are turned off
pt_br: Todas as otimizações estão desativadas

source: Optimization is on but left j unchanged (single plain symbol): '%s'
pt_br: A otimização está ativada, mas j deixado inalterado (único símbolo simples): '%s'

source: Internal error: length(irows)!=length(o__)
pt_br: Erro interno: length(irows)!=length(o__)

source: Making each group and running j (GForce %s) ...
pt_br: Fazendo cada grupo e executando j (GForce %s)...

source: setkey() after the := with keyby= ...
pt_br: setkey() após := com keyby= ...

source: The setkey() normally performed by keyby= has been skipped (as if by= was used) because := is being used together with keyby= but the keyby= contains some expressions. To avoid this warning, use by= instead, or provide existing column names to keyby=.
pt_br: O setkey() normalmente executado por keyby= foi ignorado (como se by= fosse usado) porque := está sendo usado junto com keyby= mas keyby= contém algumas expressões. Para evitar esse aviso, use by= ou forneça nomes de colunas existentes para keyby=.

source: Internal error: jvnames is length %d but ans is %d and bynames is %d
pt_br: Erro interno: jvnames tem comprimento %d, mas ans é %d e bynames é %d

source: setkey() afterwards for keyby=.EACHI ...
pt_br: setkey() depois para keyby=.EACHI ...

source: rownames and rownames.value cannot both be used at the same time
pt_br: rownames e rownames.value não podem ser usados ao mesmo tempo

source: length(rownames)==%d but nrow(DT)==%d. The rownames argument specifies a single column name or number. Consider rownames.value= instead.
pt_br: length(rownames)==%d, mas nrow(DT)==%d. O argumento rownames especifica um único nome ou número de coluna. Considere usar rownames.value= em vez disso.

source: length(rownames)==0 but should be a single column name or number, or NULL
pt_br: length(rownames)==0, mas deve ser um nome ou número de única coluna, ou NULL

source: rownames is TRUE but key has multiple columns %s; taking first column x[,1] as rownames
pt_br: rownames é TRUE, mas a chave possui múltiplas colunas %s; obtendo a primeira coluna x[,1] como rownames

source: '%s' is not a column of x
pt_br: '%s' não é uma coluna de x

source: as.integer(rownames)==%d which is outside the column number range [1,ncol=%d].
pt_br: as.integer(rownames)==%d que está fora do intervalo de números de coluna [1,ncol=%d].

source: length(rownames.value)==%d but should be nrow(x)==%d
pt_br: length(rownames.value)==%d, mas deveria ser nrow(x)==%d

source: Internal error: as.matrix.data.table length(X)==%d but a dimension is zero
pt_br: Erro interno: as.matrix.data.table com length(X)==%d, mas uma dimensão é zero

source: When i is a matrix in DT[i]<-value syntax, it doesn't make sense to provide j
pt_br: Quando i é uma matriz na sintaxe DT[i]<-valor, não faz sentido fornecer j

source: j must be an atomic vector, see ?is.atomic
pt_br: j deve ser um vetor atômico, veja ?is.atomic

source: NA in j
pt_br: NA em j

source: j must be vector of column name or positions
pt_br: j deve ser o vetor de posições ou nome de coluna

source: Attempt to assign to column position greater than ncol(x). Create the column by name, instead. This logic intends to catch (most likely) user errors.
pt_br: Tente atribuir à coluna uma posição maior que ncol(x). Em vez disso, crie a coluna por nome. Esta lógica pretende capturar (provavelmente) erros do usuário.

source: data.table inherits from data.frame (from v1.5), but this data.table does not. Has it been created manually (e.g. by using 'structure' rather than 'data.table') or saved to disk using a prior version of data.table?
pt_br: data.table herda de data.frame (desde v1.5), mas este data.table não. Ele foi criado manualmente (por exemplo, usando 'structure' em vez de 'data.table') ou salvo em disco usando uma versão anterior de data.table?

source: attempting to assign invalid object to dimnames of a data.table
pt_br: tentando atribuir objeto inválido a dimnames de um data.table

source: data.tables do not have rownames
pt_br: data.tables não tem rownames

source: Can't assign %d names to a %d-column data.table
pt_br: Não é possível atribuir %d nomes a um data.table de %d colunas

source: 'subset' must evaluate to logical
pt_br: 'subset' deve ser avaliado para tipo lógico

source: Argument 'invert' must be logical TRUE/FALSE
pt_br: Argumento 'invert' deve ser lógico TRUE/FALSE

source: x argument must be a data.table
pt_br: o argumento x deve ser um data.table

source: group length is 0 but data nrow > 0
pt_br: o comprimento do grupo é 0, mas os dados têm nrow > 0

source: passing 'f' argument together with 'by' is not allowed, use 'by' when split by column in data.table and 'f' when split by external factor
pt_br: passar o argumento 'f' junto com 'by' não é permitido, use 'by' quando dividido por coluna no data.table e 'f' quando dividido por fator externo

source: Either 'by' or 'f' argument must be supplied
pt_br: O argumento 'by' ou 'f' deve ser fornecido

source: Column '.ll.tech.split' is reserved for split.data.table processing
pt_br: A coluna '.ll.tech.split' é reservada para processamento split.data.table

source: Column '.nm.tech.split' is reserved for split.data.table processing
pt_br: A coluna '.nm.tech.split' é reservada para processamento split.data.table

source: Argument 'by' must refer to column names in x
pt_br: O argumento 'by' deve se referir aos nomes das colunas em x

source: Argument 'by' must refer only to atomic-type columns, but the following columns are non-atomic: %s
pt_br: O argumento 'by' deve referir-se apenas a colunas do tipo atômico, mas as seguintes colunas não são atômicas: %s

source: Processing split.data.table with: %s
pt_br: Processando split.data.table com: %s

source: x is not a data.table|frame. Shallow copy is a copy of the vector of column pointers (only), so is only meaningful for data.table|frame
pt_br: x não é um data.table|frame. A cópia rasa é uma cópia do vetor de ponteiros de coluna (apenas), portanto, só é significativa para data.table|frame

source: setalloccol attempting to modify `*tmp*`
pt_br: setalloccol tentando modificar `*tmp*`

source: Input is a length=1 logical that points to the same address as R's global value. Therefore the attribute has not been set by reference, rather on a copy. You will need to assign the result back to a variable. See issue #1281.
pt_br: A entrada é um tipo lógico de comprimento 1 que aponta para o mesmo endereço que o valor global de R. Portanto, o atributo não foi definido por referência, mas sim por uma cópia. Você precisará atribuir o resultado de volta a uma variável. Consulte o issue #1281.

source: x is not a data.table or data.frame
pt_br: x não é um data.table ou data.frame

source: x has %d columns but its names are length %d
pt_br: x tem %d colunas, mas seus nomes têm comprimento %d

source: Passed a vector of type '%s'. Needs to be type 'character'.
pt_br: Passou um vetor do tipo '%s'. Precisa ser do tipo 'character'.

source: 'new' is not a character vector or a function
pt_br: 'new' não é um vetor de caracteres ou uma função

source: NA in 'new' at positions %s
pt_br: NA em 'new' nas posições %s

source: Some duplicates exist in 'old': %s
pt_br: Existem algumas duplicatas em 'old': %s

source: 'old' is type %s but should be integer, double or character
pt_br: 'old' é do tipo %s, mas deve ser inteiro, double ou caractere

source: 'old' is length %d but 'new' is length %d
pt_br: 'old' tem comprimento %d, mas 'new' tem comprimento %d

source: NA (or out of bounds) in 'old' at positions %s
pt_br: NA (ou fora dos limites) em 'old' nas posições %s

source: Item %d of 'old' is '%s' which appears several times in column names. Just the first will be changed. There are %d other items in 'old' that are also duplicated in column names.
pt_br: O item %d de 'old' é '%s' que aparece várias vezes nos nomes das colunas. Apenas o primeiro será alterado. Existem %d outros itens em 'old' que também estão duplicados nos nomes das colunas.

source: Items of 'old' not found in column names: %s. Consider skip_absent=TRUE.
pt_br: Itens de 'old' não encontrados nos nomes das colunas: %s. Considere skip_absent=TRUE.

source: Internal error: length(i)!=length(new)
pt_br: Erro interno: length(i)!=length(new)

source: x has some duplicated column name(s): %s. Please remove or rename the duplicate(s) and try again.
pt_br: x tem alguns nomes de coluna duplicados: %s. Remova ou renomeie as duplicatas e tente novamente.

source: Provide either before= or after= but not both
pt_br: Forneça before= ou after=, mas não ambos

source: before=/after= accept a single column name or number, not more than one
pt_br: before=/after= aceitam um único nome ou número de coluna, não mais do que um

source: Input is %s but should be a plain list of items to be stacked
pt_br: A entrada é %s, mas deve ser uma lista simples de itens a serem empilhados

source: idcol must be a logical or character vector of length 1. If logical TRUE the id column will named '.id'.
pt_br: idcol deve ser um vetor de valores lógicos ou caracteres de comprimento 1. Se for lógico TRUE, o id da coluna será denominada '.id'.

source: use.names=NA invalid
pt_br: use.names=NA inválido

source: use.names='check' cannot be used explicitly because the value 'check' is new in v1.12.2 and subject to change. It is just meant to convey default behavior. See ?rbindlist.
pt_br: use.names='check' não pode ser usado explicitamente porque o valor 'check' é novo na v1.12.2 e está sujeito a alterações. O objetivo é apenas transmitir o comportamento padrão. Consulte ?rbindlist.

source: Check that is.data.table(DT) == TRUE. Otherwise, :=, `:=`(...) and let(...) are defined for use in j, once only and in particular ways. See help(":=").
pt_br: Verifique se is.data.table(DT) == TRUE. Caso contrário, :=, `:=`(...) e let(...) são definidos para uso em j, apenas uma vez e de maneiras específicas. Veja help(":=").

source: setDF only accepts data.table, data.frame or list of equal length as input
pt_br: setDF aceita apenas data.table, data.frame ou lista de igual comprimento como entrada

source: rownames contains duplicates
pt_br: rownames contém duplicatas

source: rownames incorrect length; expected %d names, got %d
pt_br: rownames com comprimento incorreto; esperava %d nomes, obteve %d

source: All elements in argument 'x' to 'setDF' must be of same length
pt_br: Todos os elementos no argumento 'x' para 'setDF' devem ter o mesmo comprimento

source: Cannot find symbol %s
pt_br: Não foi possível encontrar o símbolo %s

source: Cannot convert '%1$s' to data.table by reference because binding is locked. It is very likely that '%1$s' resides within a package (or an environment) that is locked to prevent modifying its variable bindings. Try copying the object to your current environment, ex: var <- copy(var) and then using setDT again.
pt_br: Não é possível converter '%1$s' em data.table por referência porque o vínculo está travado. É muito provável que '%1$s' resida em um pacote (ou ambiente) que esteja travado para evitar a modificação de seus vínculos de variáveis. Tente copiar o objeto para o seu ambiente atual, ex: var <- copy(var) e depois usar setDT novamente.

source: Some columns are a multi-column type (such as a matrix column): %s. setDT will retain these columns as-is but subsequent operations like grouping and joining may fail. Please consider as.data.table() instead which will create a new column for each embedded column.
pt_br: Algumas colunas são do tipo multicolunas (como uma coluna de matriz): %s. setDT manterá essas colunas como estão, mas operações subsequentes, como agrupamento e junção, poderão falhar. Considere usar as.data.table(), que criará uma nova coluna para cada coluna incorporada.

source: Column %d is of POSIXlt type. Please convert it to POSIXct using as.POSIXct and run setDT again. We do not recommend use of POSIXlt at all because it uses 40 bytes to store one date.
pt_br: A coluna %d é do tipo POSIXlt. Por favor, converta-o para POSIXct usando as.POSIXct e execute setDT novamente. Não recomendamos o uso de POSIXlt porque ele usa 40 bytes para armazenar uma data.

source: All elements in argument 'x' to 'setDT' must be of same length, but the profile of input lengths (length:frequency) is: %s The first entry with fewer than %d entries is %d.
pt_br: Todos os elementos no argumento 'x' para 'setDT' devem ter o mesmo comprimento, mas o perfil dos comprimentos de entrada (comprimento:frequência) é: %s A primeira entrada com menos de %d entradas é %d.

source: Argument 'x' to 'setDT' should be a 'list', 'data.frame' or 'data.table'
pt_br: O argumento 'x' para 'setDT' deve ser uma 'list', 'data.frame' ou 'data.table'

source: Item '%s' not found in names of input list
pt_br: Item '%s' não encontrado nos nomes da lista de entradas

source: 'prefix' must be NULL or a character vector of length 1.
pt_br: 'prefix' deve ser NULL ou um vetor de caracteres de comprimento 1.

source: x is a single vector, non-NULL 'cols' doesn't make sense.
pt_br: x é um único vetor, 'cols' não NULL não faz sentido.

source: x is a list, 'cols' cannot be 0-length.
pt_br: x é uma lista, 'cols' não pode ter comprimento 0.

source: RHS of %s is length %d which is not 1 or nrow (%d). For robustness, no recycling is allowed (other than of length 1 RHS). Consider %%in%% instead.
pt_br: Lado direito (RHS) de %s tem comprimento %d que não é 1 ou nrow (%d). Para maior robustez, nenhuma reciclagem é permitida (exceto em lado direito de comprimento 1). Considere %%in%% em vez disso.

source: Internal error in .isFastSubsettable. Please report to data.table developers
pt_br: Erro interno em .isFastSubsettable. Por favor, relate aos desenvolvedores do data.table

source: Subsetting optimization disabled because the cross-product of RHS values exceeds 1e4, causing memory problems.
pt_br: A otimização da divisão em subconjuntos foi desativada porque o produto vetorial dos valores do lado direito (RHS) excede 1e4, causando problemas de memória.

source: Optimized subsetting with key %s
pt_br: Divisão de subconjunto otimizada com chave %s

source: Optimized subsetting with index '%s'
pt_br: Divisão de subconjunto otimizada com índice '%s'

source: Creating new index '%s'
pt_br: Criando novo índice '%s'

source: Creating index %s done in ...
pt_br: Criação do índice %s feita em ...

source: 'on' argument should be a named atomic vector of column names indicating which columns in 'i' should be joined with which columns in 'x'.
pt_br: O argumento 'on' deve ser um vetor atômico nomeado de nomes de colunas indicando quais colunas em 'i' devem ser unidas a quais colunas em 'x'.

source: Found more than one operator in one 'on' statement: %s. Please specify a single operator.
pt_br: Encontrado mais de um operador em uma instrução 'on': %s. Especifique um único operador.

source: 'on' contains no column name: %s. Each 'on' clause must contain one or two column names.
pt_br: 'on' não contém nome de coluna: %s. Cada cláusula 'on' deve conter um ou dois nomes de coluna.

source: 'on' contains more than 2 column names: %s. Each 'on' clause must contain one or two column names.
pt_br: 'on' contém mais de 2 nomes de colunas: %s. Cada cláusula 'on' deve conter um ou dois nomes de coluna.

source: Invalid join operators %s. Only allowed operators are %s.
pt_br: Operadores de junção inválidos %s. Somente operadores permitidos são %s.
