Repository: rffontenelle/r-datatable-pt_br
Catalog: */R-data.table.po
Languages: pt_br

source: key argument of data.table() must be character
pt_br: o argumento key do data.table() deve ser caractere

source: Object '%s' not found. Perhaps you intended %s
pt_br: Objeto '%s' não encontrado. Talvez sua intenção fosse %s

source: Object '%s' not found amongst %s
pt_br: Objeto '%s' não encontrado entre %s

source: verbose must be logical or integer
pt_br: verbose deve ser lógico ou inteiro

source: verbose must be length 1 non-NA
pt_br: verbose deve ser não NA e de comprimento 1

source: Ignoring by/keyby because 'j' is not supplied
pt_br: Ignorando by/keyby porque 'j' não foi fornecido

source: When by and keyby are both provided, keyby must be TRUE or FALSE
pt_br: Quando by e keyby são ambos fornecidos, keyby deve ser TRUE ou FALSE

source: Argument '%s' after substitute: %s
pt_br: Argumento '%s' após substituto: %s

source: When on= is provided but not i=, on= must be a named list or data.table|frame, and a natural join (i.e. join on common names) is invoked. Ignoring on= which is '%s'.
pt_br: Quando on= é fornecido, mas não i=, on= deve ser uma lista nomeada ou data.table|frame, e uma junção natural (ou seja, junção em nomes comuns) é invocada. Ignorando on= , que é '%s'.

source: i and j are both missing so ignoring the other arguments. This warning will be upgraded to error in future.
pt_br: i e j estão faltando, ignorando os outros argumentos. Este aviso será atualizado para se tornar um erro no futuro.

source: mult argument can only be 'first', 'last' or 'all'
pt_br: o argumento mult só pode ser 'first', 'last' ou 'all'

source: roll must be a single TRUE, FALSE, positive/negative integer/double including +Inf and -Inf or 'nearest'
pt_br: roll deve ser TRUE, FALSE, número inteiro/duplo positivo/negativo, incluindo +Inf e -Inf ou 'nearest'

source: roll is '%s' (type character). Only valid character value is 'nearest'.
pt_br: roll é '%s' (tipo caractere). O único valor de caractere válido é 'nearest'.

source: rollends must be a logical vector
pt_br: rollends deve ser um vetor lógico

source: rollends must be length 1 or 2
pt_br: rollends deve ter comprimento 1 ou 2

source: nomatch= must be either NA or NULL (or 0 for backwards compatibility which is the same as NULL but please use NULL)
pt_br: nomatch= deve ser NA ou NULL (ou 0 para compatibilidade com versões anteriores, que é igual a NULL, mas use NULL)

source: which= must be a logical vector length 1. Either FALSE, TRUE or NA.
pt_br: which= deve ser um vetor lógico de comprimento 1. FALSE, TRUE ou NA.

source: which==%s (meaning return row numbers) but j is also supplied. Either you need row numbers or the result of j, but only one type of result can be returned.
pt_br: which==%s (significando retornar números de linha), mas j também é fornecido. Ou você precisa de números de linha ou do resultado de j, mas apenas um tipo de resultado pode ser retornado.

source: which=NA with nomatch=0|NULL would always return an empty vector. Please change or remove either which or nomatch.
pt_br: which=NA com nomatch=0|NULL sempre retornaria um vetor vazio. Favor alterar ou remover ou which, ou nomatch.

source: j must be provided when with=FALSE
pt_br: j deve ser fornecido quando with=FALSE

source: The symbol .. is invalid. The .. prefix must be followed by at least one character.
pt_br: O símbolo .. é inválido. O prefixo .. deve ser seguido por pelo menos um caractere.

source: Variable '..%s' does exist in calling scope though, so please just removed the .. prefix from that variable name in calling scope.
pt_br: A variável '..%s' existe no escopo de chamada, portanto, então favor simplesmente remover o prefixo .. desse nome de variável no escopo de chamada.

source: Variable '%s' is not found in calling scope. Looking in calling scope because you used the .. prefix.%s
pt_br: A variável '%s' não foi encontrada no escopo de chamada. Procurando no escopo de chamada porque você usou .. como prefixo.%s

source: Both '%1$s' and '..%1$s' exist in calling scope. Please remove the '..%1$s' variable in calling scope for clarity.
pt_br: Tanto '%1$s' quanto '..%1$s' existem no escopo de chamada. Remova a variável '..%1$s' na chamada do escopo para maior clareza.

source: Internal error: DT[, ..var] should be dealt with by the branch above now.
pt_br: Erro interno: agora o branch acima deveria ter lidado com DT[, ..var].

source: Variable '%s' is not found in calling scope. Looking in calling scope because you set with=FALSE. Also, please use .. symbol prefix and remove with=FALSE.
pt_br: A variável '%s' não foi encontrada no escopo de chamada. Procurando no escopo de chamada porque você definiu with=FALSE. Além disso, favor usr o prefixo de símbolo .. e remover with=FALSE.

source: You have wrapped := with {} which is ok but then := must be the only thing inside {}. You have something else inside {} as well. Consider placing the {} on the RHS of := instead; e.g. DT[,someCol:={tmpVar1<-...;tmpVar2<-...;tmpVar1*tmpVar2}
pt_br: Você envolveu := com {}, o que está tudo bem, mas := deve ser a única coisa dentro de {}. Você também tem algo mais dentro de {}. Considere colocar {} ao lado direito de :=; por exemplo, DT[,algumaCol:={tmpVar1<-...;tmpVar2<-...;tmpVar1*tmpVar2}]

source: := with keyby is only possible when i is not supplied since you can't setkey on a subset of rows. Either change keyby to by or remove i
pt_br: := com keyby só é possível quando i não é fornecido, pois você não pode definir a chave em um subconjunto de linhas. Ou altere keyby para by, ou remova i

source: nomatch isn't relevant together with :=, ignoring nomatch
pt_br: nomatch não é relevante junto com :=, ignorando nomatch

source: not-join '!' prefix is present on i but nomatch is provided. Please remove nomatch.
pt_br: prefixo '!', não de junção, está presente em i, mas nomatch foi fornecido. Por favor, remova nomatch.

source: Operator := detected in i, the first argument inside DT[...], but is only valid in the second argument, j. Most often, this happens when forgetting the first comma (e.g. DT[newvar := 5] instead of DT[ , new_var := 5]). Please double-check the syntax. Run traceback(), and debugger() to get a line number.
pt_br: Operador := detectado em i, o primeiro argumento dentro de DT[...], mas só é válido no segundo argumento, j. Na maioria das vezes, isso acontece quando se esquece a primeira vírgula (por exemplo, DT[nova_var := 5] em vez de DT[ , nova_var := 5]). Verifique novamente a sintaxe. Execute traceback() e debugger() para obter um número de linha.

source: '%s' is not found in calling scope and it is not a column name either
pt_br: '%s' não foi encontrado no escopo de chamada e também não é um nome de coluna

source: '%s' is not found in calling scope, but it is a column of type %s. If you wish to select rows where that column contains TRUE, or perhaps that column contains row numbers of itself to select, try DT[(col)], DT[DT$col], or DT[col==TRUE} is particularly clear and is optimized
pt_br: '%s' não foi encontrado no escopo de chamada, mas é uma coluna do tipo %s. Se você deseja selecionar linhas onde essa coluna contém TRUE, ou talvez onde essa coluna contenha números de linha para selecionar, tente DT[(col)], DT[DT$col] ou DT[col==TRUE}, o que é particularmente claro e otimizado

source: %s. When the first argument inside DT[...] is a single symbol (e.g. DT[var]), data.table looks for var in calling scope.
pt_br: %s. Quando o primeiro argumento dentro de DT[...] é um único símbolo (por exemplo, DT[var]), data.table procura por var na chamada do escopo.

source: i is invalid type (matrix). Perhaps in future a 2 column matrix could return a list of elements of DT (in the spirit of A[B] in FAQ 2.14). Please report to data.table issue tracker if you'd like this, or add your comments to FR #657.
pt_br: i é um tipo inválido (matrix). Talvez no futuro uma matriz de 2 colunas possa retornar uma lista de elementos de DT (no espírito de A[B] no FAQ 2.14). Por favor, relate no rastreador de problemas do data.table se desejar isso, ou adicione seus comentários ao FR #657.

source: When i is a data.table (or character vector), the columns to join by must be specified using 'on=' argument (see ?data.table), by keying x (i.e. sorted, and, marked as sorted, see ?setkey), or by sharing column names between x and i (i.e., a natural join). Keyed joins might have further speed benefits on very large data due to x being sorted in RAM.
pt_br: Quando i é uma data.table (ou vetor de caracteres), as colunas nas quais fazer a junção devem ser especificadas usando o argumento 'on=' (consulte ?data.table), por meio de chaveamento de x (ou seja, ordenado e marcado como ordenado, consulte ?setkey) ou compartilhando de nomes de colunas entre x e i (ou seja, uma junção natural). As junções chaveadas podem ter benefícios adicionais de velocidade em dados muito grandes devido ao x estar ordenado na RAM.

source: Attempting to do natural join but no common columns in provided tables
pt_br: Tentando fazer junção natural, mas não há colunas comuns nas tabelas fornecidas

source: Joining but 'x' has no key, natural join using all 'x' columns
pt_br: Junção sendo que 'x' não tem chave, então fazendo junção natural usando todas as colunas de 'x'

source: Joining but 'x' has no key, natural join using: %s
pt_br: Junção sendo que 'x' não tem chave, então fazendo junção natural usando: %s

source: not-join called with 'by=.EACHI'; Replacing !i with i=setdiff_(x,i) ...
pt_br: not-join chamado com 'by=.EACHI'; substituindo !i por i=setdiff_(x,i) ...

source: done in %s
pt_br: concluído em %s

source: Constructing irows for '!byjoin || nqbyjoin' ...
pt_br: Construindo irows para '!byjoin || nqbyjoin' ...

source: Internal error. Cannot by=.EACHI when joining to an index, yet
pt_br: Erro interno. Ainda não é possível usar by=.EACHI ao fazer junção em um índice

source: Internal error. irows has length in by=.EACHI
pt_br: Erro interno. irows tem comprimento em by=.EACHI

source: Reorder irows for 'mult=="all" && !allGrp1' ...
pt_br: Reordenar irows para 'mult=="all" && !allGrp1' ...

source: Reordering %d rows after bmerge done in ...
pt_br: Reordenando %d linhas após bmerge feito em ...

source: logical error. i is not a data.table, but 'on' argument is provided.
pt_br: erro lógico. i não é uma data.table, mas o argumento 'on' foi fornecido.

source: i has evaluated to type %s. Expecting logical, integer or double.
pt_br: i é avaliado para o tipo %s. Esperava lógico, inteiro ou 'double'.

source: internal error: notjoin and which=NA (non-matches), huh? please provide reproducible example to issue tracker
pt_br: erro interno: notjoin e which=NA (não correspondências). Mas hein? Por favor, forneça um exemplo reproduzível no rastreador de problemas

source: i evaluates to a logical vector length %d but there are %d rows. Recycling of logical i is no longer allowed as it hides more bugs than is worth the rare convenience. Explicitly use rep(...,length=.N) if you really need to recycle.
pt_br: i é avaliado como um vetor lógico de comprimento %d, mas há %d linhas. A reciclagem do i lógico não é mais permitida, pois mais esconde bugs do que vale a rara conveniência. Use explicitamente rep(...,length=.N) se você realmente precisar reciclar.

source: Internal error: notjoin but byjoin or !integer or nomatch==NA
pt_br: Erro interno: notjoin, mas byjoin ou !integer ou nomatch==NA

source: Inverting irows for notjoin done in ...
pt_br: Inversão de irows por notjoin feita em ...

source: with=FALSE together with := was deprecated in v1.9.4 released Oct 2014. Please wrap the LHS of := with parentheses; e.g., DT[,(myVar):=sum(b),by=a] to assign to column name(s) held in variable myVar. See ?':=' for other examples. As warned in 2014, this is now a warning.
pt_br: o uso de with=FALSE junto com := foi descontinuado em v1.9.4, lançado em outubro de 2014. Coloque o LHS de := entre parênteses; por exemplo, DT[,(myVar):=sum(b),by=a] para atribuir nomes de colunas mantidos na variável myVar. Veja ?':=' para outros exemplos. Tal como avisado em 2014, isto é agora um aviso.

source: with=FALSE ignored, it isn't needed when using :=. See ?':=' for examples.
pt_br: with=FALSE ignorado, não é necessário ao usar :=. Veja ?':=' para exemplos.

source: column(s) not removed because not found: %s
pt_br: coluna(s) não removida(s) por não ter(em) sido encontrada(s): %s

source: column(s) not found: %s
pt_br: coluna(s) não encontrada(s): %s

source: Item %d of j is %d which is outside the column number range [1,ncol=%d]
pt_br: O item %d de j é %d, o qual está fora do intervalo de números de colunas [1,ncol=%d]

source: j mixes positives and negatives
pt_br: j mistura positivos e negativos

source: When with=FALSE, j-argument should be of type logical/character/integer indicating the columns to select.
pt_br: Quando with=FALSE, o argumento j deve ser do tipo lógico/caractere/inteiro indicando as colunas a serem selecionadas.

source: 'by' contains .I but only the following are currently supported: by=.I, by=.(.I), by=c(.I), by=list(.I)
pt_br: 'by' contém .I, mas apenas o seguinte é suportado atualmente: by=.I, by=.(.I), by=c(.I), by=list(.I)

source: by=c(...), key(...) or names(...) must evaluate to 'character'
pt_br: by=c(...), key(...) ou names(...) devem ser avaliados para 'character'

source: 'by' is a character vector length %d but one or more items include a comma. Either pass a vector of column names (which can contain spaces, but no commas), or pass a vector length 1 containing comma separated column names. See ?data.table for other possibilities.
pt_br: 'by' é um vetor de caracteres de comprimento %d, mas um ou mais itens incluem uma vírgula. Passe um vetor de nomes de colunas (que pode conter espaços, mas sem vírgulas) ou passe um vetor de comprimento 1 contendo nomes de colunas separados por vírgulas. Consulte ?data.table para outras possibilidades.

source: by index '%s' but that index has 0 length. Ignoring.
pt_br: pelo índice '%s', mas esse índice tem comprimento 0. Ignorando.

source: Internal error: irows isn't integer
pt_br: Erro interno: irows não é inteiro

source: i clause present and columns used in by detected, only these subset: %s
pt_br: cláusula i presente e colunas usadas em by detectadas, apenas esses subconjuntos: %s

source: i clause present but columns used in by not detected. Having to subset all columns before evaluating 'by': '%s'
pt_br: cláusula i presente, mas colunas usadas em by não detectadas. Necessário dividir em subconjuntos todas as colunas antes de avaliar 'by': '%s'

source: 'by' appears to evaluate to column names but isn't c() or key(). Use by=list(...) if you can. Otherwise, by=eval%s should work. This is for efficiency so data.table can detect which columns are needed.
pt_br: 'by' parece avaliar nomes de colunas, mas não é c() ou key(). Use by=list(...) se puder. Caso contrário, by=eval%s deve funcionar. Isso é para maior eficiência, para que data.table possa detectar quais colunas são necessárias.

source: 'by' or 'keyby' must evaluate to a vector or a list of vectors (where 'list' includes data.table and data.frame which are lists, too)
pt_br: 'by' ou 'keyby' deve ser avaliado como um vetor ou uma lista de vetores (onde 'list' inclui data.table e data.frame que também são listas)

source: Column or expression %d of 'by' or 'keyby' is type '%s' which is not currently supported. If you have a compelling use case, please add it to https://github.com/Rdatatable/data.table/issues/1597. As a workaround, consider converting the column to a supported type, e.g. by=sapply(list_col, toString), whilst taking care to maintain distinctness in the process.
pt_br: A coluna ou expressão %d de 'by' ou 'keyby' é do tipo '%s' e não é suportada atualmente. Se você tiver um caso de uso atraente, adicione-o a https://github.com/Rdatatable/data.table/issues/1597. Como solução alternativa, considere converter a coluna em um tipo compatível, por exemplo. by=sapply(list_col, toString), tomando cuidado para manter a distinção no processo.

source: The items in the 'by' or 'keyby' list are length(s) %s. Each must be length %d; the same length as there are rows in x (after subsetting if i is provided).
pt_br: Os itens na lista 'by' ou 'keyby' têm comprimento(s) %s. Cada um deve ter comprimento %d; o mesmo comprimento que há linhas em x (após dividir em subconjuntos se i for fornecido).

source: by-expression '%s' is not named, and the auto-generated name '%s' clashed with variable(s) in j. Therefore assigning the entire by-expression as name.
pt_br: a expressão by '%s' não é nomeada e o nome gerado automaticamente '%s' entra em conflito com variáveis em j. Portanto, atribuindo toda a expressão by como nome.

source: Internal error: drop_dot passed %d items
pt_br: Erro interno: drop_dot passou %d itens

source: Item %d of the .() or list() passed to j is missing
pt_br: O item %d de .() ou list() passado para j está ausente

source: j may not evaluate to the same number of columns for each group; if you're sure this warning is in error, please put the branching logic outside of [ for efficiency
pt_br: j não pode ser avaliado com o mesmo número de colunas para cada grupo; se você tiver certeza de que este aviso está errado, coloque a lógica de branching fora de [ para eficiência

source: Different branches of j expression produced different auto-named columns: %s; using the most "last" names. If this was intentional (e.g., you know only one branch will ever be used in a given query because the branch is controlled by a function argument), please (1) pull this branch out of the call; (2) explicitly provide missing defaults for each branch in all cases; or (3) use the same name for each branch and re-name it in a follow-up call.
pt_br: Diferentes branches da expressão j produziram diferentes colunas nomeadas automaticamente: %s; usando a maioria dos "últimos" nomes. Se isso foi intencional (por exemplo, você sabe que apenas um branch será usado em uma determinada consulta porque o branch é controlado por um argumento de função). Por favor, (1) retire esse branch da chamada; (2) forneça explicitamente os padrões ausentes para cada branch em todos os casos; ou (3) use o mesmo nome para cada branch e renomeie-o em uma chamada seguinte.

source: When .SDcols is a function, it is applied to each column; the output of this function must be a non-missing boolean scalar signalling inclusion/exclusion of the column. However, these conditions were not met for: %s
pt_br: Quando .SDcols é uma função, ela é aplicada a cada coluna; a saída desta função deve ser um escalar booleano não ausente sinalizando inclusão/exclusão da coluna. No entanto, estas condições não foram cumpridas para: %s

source: .SDcols missing at the following indices: %s
pt_br: .SDcols ausentes nos seguintes índices: %s

source: .SDcols is a logical vector length %d but there are %d columns
pt_br: .SDcols tem um vetor lógico de comprimento %d, mas existem %d colunas

source: .SDcols is numeric but has both +ve and -ve indices
pt_br: .SDcols é numérico, mas possui índices +ve e -ve

source: .SDcols is numeric but out of bounds [1, %d] at: %s
pt_br: .SDcols é numérico, mas está fora dos limites [1, %d] em: %s

source: .SDcols should be column numbers or names
pt_br: .SDcols devem ser números ou nomes de colunas

source: Some items of .SDcols are not column names: %s
pt_br: Alguns itens de .SDcols não são nomes de colunas: %s

source: '(m)get' found in j. ansvars being set to all columns. Use .SDcols or a single j=eval(macro) instead. Both will detect the columns used which is important for efficiency. Old ansvars: %s
pt_br: '(m)get' encontrado em j. ansvars sendo definido para todas as colunas. Use .SDcols ou um único j=eval(macro) em vez disso. Ambos detectarão as colunas utilizadas, o que é importante para a eficiência. ansvars antigo: %s

source: New ansvars: %s
pt_br: Novo ansvars: %s

source: This j doesn't use .SD but .SDcols has been supplied. Ignoring .SDcols. See ?data.table.
pt_br: Este j não usa .SD, mas .SDcols foi fornecido. Ignorando .SDcols. Consulte ?data.table.

source: Detected that j uses these columns: %s
pt_br: Detectado que j usa estas colunas: %s

source: .SD is locked. Using := in .SD's j is reserved for possible future use; a tortuously flexible way to modify by group. Use := in j directly to modify by group by reference.
pt_br: .SD está travado. O uso de := em .SD j está reservado para possível uso futuro; uma maneira tortuosamente flexível de modificar por grupo. Use := in j diretamente para modificar por grupo por referência.

source: In %s(col1=val1, col2=val2, ...) form, all arguments must be named.
pt_br: Na forma %s(col1=val1, col2=val2, ...), todos os argumentos devem ser nomeados.

source: LHS of := must be a symbol, or an atomic vector (column names or positions).
pt_br: LHS de := deve ser um símbolo ou um vetor atômico (nomes de colunas ou posições).

source: LHS of := appears to be column positions but are outside [1,ncol] range. New columns can only be added by name.
pt_br: LHS de := parecem ser posições de coluna, mas estão fora do intervalo [1,ncol]. Novas colunas só podem ser adicionadas por nome.

source: LHS of := isn't column names ('character') or positions ('integer' or 'numeric')
pt_br: LHS de := não são nomes de colunas ('character') ou posições ('integer' ou 'numeric')

source: No rows match i. No new columns to add so not evaluating RHS of := Assigning to 0 row subset of %d rows
pt_br: Nenhuma linha corresponde a i. Não há novas colunas para adicionar, portanto não será avaliado RHS de := Atribuindo a 0 subconjunto de linhas com %d linhas

source: Invalid .internal.selfref detected and fixed by taking a (shallow) copy of the data.table so that := can add this new column by reference. At an earlier point, this data.table has been copied by R (or was created manually using structure() or similar). Avoid names<- and attr<- which in R currently (and oddly) may copy the whole data.table. Use set* syntax instead to avoid copying: ?set, ?setnames and ?setattr. If this message doesn't help, please report your use case to the data.table issue tracker so the root cause can be fixed or this message improved.
pt_br: .internal.selfref inválido detectado e corrigido fazendo uma cópia (rasa) do data.table para que := possa adicionar esta nova coluna por referência. Anteriormente, este data.table foi copiado por R (ou foi criado manualmente usando structure() ou similar). Evite nomes<- e atributo<- que, atualmente (e estranhamente) no R podem copiar todo o data.table. Use a sintaxe set* para evitar copiar: ?set, ?setnames e ?setattr. Se esta mensagem não ajudar, relate seu caso de uso ao rastreador de problemas data.table para que a causa raiz possa ser corrigida ou esta mensagem melhorada.

source: Growing vector of column pointers from truelength %d to %d. A shallow copy has been taken, see ?setalloccol. Only a potential issue if two variables point to the same data (we can't yet detect that well) and if not you can safely ignore this. To avoid this message you could setalloccol() first, deep copy first using copy(), wrap with suppressWarnings() or increase the 'datatable.alloccol' option.
pt_br: Vetor crescente de ponteiros de coluna de truelength %d para %d. Uma cópia rasa foi obtida, consulte ?setalloccol. Apenas um problema potencial se duas variáveis apontarem para os mesmos dados (ainda não podemos detectar isso bem) e, do contrário, você pode ignorar isso com segurança. Para evitar esta mensagem, você pode usar primeiro setalloccol(), fazer uma cópia profunda primeiro usando copy(), cercar com suprimirWarnings() ou aumentar a opção 'datatable.alloccol'.
