Repository: rffontenelle/r-datatable-pt_br
Catalog: */R-onAttach.po
Languages: pt_br

source: data.table %s IN DEVELOPMENT built %s%s using %d threads (see ?getDTthreads).
pt_br: data.table %s EM DESENVOLVIMENTO construído %s%s usando %d threads (veja ?getDTthreads).

source: data.table %s using %d threads (see ?getDTthreads).
pt_br: data.table %s usando %d threads (veja ?getDTthreads).

source: Latest news: r-datatable.com
pt_br: Últimas notícias: r-datatable.com

source: TRANSLATION CHECK
pt_br: VERIFICAÇÃO DE TRADUÇÃO

source: ********** Running data.table in English; package support is available in English only. When searching for online help, be sure to also check for the English error message. This can be obtained by looking at the po/R-<locale>.po and po/<locale>.po files in the package source, where the native language and English error messages can be found side-by-side **********
pt_br: ********** Executando data.table em inglês; o suporte ao pacote está disponível apenas em inglês. Ao procurar ajuda online, certifique-se de verificar também a mensagem de erro em inglês. Isso pode ser obtido examinando os arquivos po/R-<locale>.po e po/<locale>.po no código-fonte do pacote, onde as mensagens de erro no idioma nativo e em inglês podem ser encontradas lado a lado. **********

source: ********** This development version of data.table was built more than 4 weeks ago. Please update: data.table::update_dev_pkg() **********
pt_br: ********** Esta versão de desenvolvimento do data.table foi construída há mais de 4 semanas. Por favor, atualize: data.table::update_dev_pkg() **********

source: ********** This installation of data.table has not detected OpenMP support. It should still work but in single-threaded mode.
pt_br: ********** Esta instalação do data.table não detectou suporte ao OpenMP. Ainda deve funcionar, mas em modo de single-threaded.

source: This is a Mac. Please read https://mac.r-project.org/openmp/. Please engage with Apple and ask them for support. Check r-datatable.com for updates, and our Mac instructions here: https://github.com/Rdatatable/data.table/wiki/Installation. After several years of many reports of installation problems on Mac, it's time to gingerly point out that there have been no similar problems on Windows or Linux. **********
pt_br: Este é um Mac. Por favor, leia https://mac.r-project.org/openmp/. Por favor, envolva-se com a Apple e peça suporte. Verifique r-datatable.com para atualizações e nossas instruções para Mac aqui: https://github.com/Rdatatable/data.table/wiki/Installation. Após vários anos de muitos relatos de problemas de instalação no Mac, é hora de apontar cuidadosamente que não houve problemas semelhantes no Windows ou Linux. **********

source: This is %s. This warning should not normally occur on Windows or Linux where OpenMP is turned on by data.table's configure script by passing -fopenmp to the compiler. If you see this warning on Windows or Linux, please file a GitHub issue. **********
pt_br: Este é %s. Este aviso normalmente não deve ocorrer no Windows ou Linux, onde o OpenMP é ativado pelo script de configuração do data.table passando -fopenmp para o compilador. Se você vir este aviso no Windows ou Linux, por favor, relate no rastreador de problemas no GitHub. **********

source: ********** This data.table installation was compiled for R < 3.4.0 (Apr 2017) and is known to leak memory. Please upgrade R and reinstall data.table to fix the leak. Maintaining and testing code branches to support very old versions increases development time so please do upgrade R. We intend to bump data.table's dependency from 8 year old R 3.1.0 (Apr 2014) to 5 year old R 3.4.0 (Apr 2017). **********
pt_br: ********** Esta instalação do data.table foi compilada para o R < 3.4.0 (Abr 2017) e é conhecida por vazar memória. Por favor, atualize o R e reinstale o data.table para corrigir o vazamento. Manter e testar ramificações de código para suportar versões muito antigas aumenta o tempo de desenvolvimento, então, por favor, atualize o R. Pretendemos aumentar a dependência do data.table de R 3.1.0 (Abr 2014), de 8 anos, para R 3.4.0 (Abr 2017), de 5 anos. **********
