Repository: rffontenelle/r-datatable-pt_br
Catalog: */R-test.data.table.po
Languages: pt_br

source: data.table package is loaded. Unload or start a fresh R session.
pt_br: Pacote data.table está carregado. Descarregue ou inicie uma nova sessão do R.

source: script must end with '.Rraw'. If a file ending '.Rraw.bz2' exists, that will be found and used.
pt_br: script deve terminar com '.Rraw'. Se existir um arquivo terminando em '.Rraw.bz2', ele será encontrado e usado.

source: Neither %s nor %s exist in %s
pt_br: Nem %s ou %sexistem em %s

source: test.data.table() running: %s
pt_br: test.data.table() em execução: %s

source: object '%s' not found
pt_br: objeto '%s' não encontrado

source: **** This R session's language is not English. Each test will still check that the correct number of errors and/or **** warnings are produced. However, to test the text of each error/warning too, please restart R with LANGUAGE=en
pt_br: **** O idioma desta sessão do R não é inglês. Cada teste ainda verificará se o número correto de erros e/ou **** avisos são produzidos. No entanto, para testar o texto de cada erro/aviso também, por favor, reinicie o R com LANGUAGE=en

source: *** *** memtest=%d. This should be the first call in a fresh R_GC_MEM_GROW=0 R session for best results. Ctrl-C now if not. ***
pt_br: *** *** memtest=%d. Esta deve ser a primeira chamada em uma nova sessão do R_GC_MEM_GROW=0 R para obter os melhores resultados. Use Ctrl-C agora se não for o caso. ***

source: memtest intended for Linux. Step through data.table:::rss() to see what went wrong.
pt_br: memtest destinado para Linux. Percorra data.table:::rss() para ver o que deu errado.

source: Failed in %s after test %s before the next test() call in %s
pt_br: Falhou em %s após o teste %s antes da próxima chamada de test() em %s

source: %d error(s) out of %d. Search %s for test number(s) %s. Duration: %s.
pt_br: %d erro(s) de %d. Pesquise %s por número(s) de teste %s. Duração: %s.

source: Timings count mismatch: %d vs %d
pt_br: Contagem de tempos não corresponde: %d vs %d

source: 10 longest running tests took %ds (%d%% of %ds)
pt_br: 10 testes mais longos levaram %ds (%d%% de %ds)

source: 10 largest RAM increases (MB); see plot for cumulative effect (if any)
pt_br: 10 maiores aumentos de RAM (MB); veja o gráfico para efeito cumulativo (se houver)

source: All %d tests (last %.8g) in %s completed ok in %s
pt_br: Todos %d testes (duraram %.8g) em %s concluídos com sucesso em %s

source: Test %s is invalid: when error= is provided it does not make sense to pass y as well
pt_br: Teste %s é inválido: quando error= é fornecido, não faz sentido passar y também

source: Test id %s is not in increasing order
pt_br: ID do teste %s não está em ordem crescente

source: Test %s produced %d %ss but expected %d %s %s
pt_br: Teste %s produziu %d %ss, mas esperava-se %d %s %s

source: Test %s didn't produce the correct %s: Expected: %s Observed: %s
pt_br: Teste %s não produziu o %s correto: Esperado: %s Observado: %s

source: Output captured before unexpected warning/error/message:
pt_br: Saída capturada antes do aviso/erro/mensagem inesperado:

source: Test %s did not produce correct output:
pt_br: Teste %s não produziu a saída correta:

source: Expected: <<%s>>
pt_br: Esperado: <<%s>>

source: Observed: <<%s>>
pt_br: Observado: <<%s>>

source: Test %s produced output but should not have:
pt_br: Teste %s produziu saída, mas não deveria:

source: Expected absent (case insensitive): <<%s>>
pt_br: Esperado ausente (não sensível a maiúsculas/minúsculas): <<%s>>

source: Test %s ran without errors but selfrefok(%s) is FALSE
pt_br: Teste %s foi executado sem erros, mas selfrefok(%s) é FALSE

source: Test %s ran without errors but failed check that x equals y:
pt_br: Teste %s foi executado sem erros, mas falhou na verificação de que x é igual a y:

source: First %d of %d (type '%s'):
pt_br: Primeiro %d de %d (tipo '%s'):
