Repository: rffontenelle/r-datatable-pt_br
Catalog: */subset.po
Languages: pt_br

source: Internal error: subsetVectorRaw length(ans)==%d n=%d
pt_br: Erro interno: subsetVectorRaw length(ans)==%d n=%d

source: Internal error: column type '%s' not supported by data.table subset. All known types are supported so please report as bug.
pt_br: Erro interno: tipo de coluna '%s' não suportado pelo subconjunto do data.table. Todos os tipos conhecidos são suportados, por favor, reporte isso como um bug.

source: Internal error. Argument '%s' to %s is type '%s' not '%s'
pt_br: Erro interno. Argumento '%s' para %s é do tipo '%s', não '%s'

source: Internal error. 'idx' is type '%s' not 'integer'
pt_br: Erro interno. 'idx' é do tipo '%s' não 'integer'

source: Internal error. 'maxArg' is type '%s' and length %d, should be an integer singleton
pt_br: Erro interno. 'maxArg' é do tipo '%s' e comprimento %d, deveria ser um inteiro singleton

source: Internal error: allowOverMax must be TRUE/FALSE
pt_br: Erro interno: allowOverMax deve ser TRUE/FALSE

source: Internal error. max is %d, must be >= 0.
pt_br: Erro interno. max é %d, deve ser >= 0.

source: Internal error: allowNAArg must be TRUE/FALSE
pt_br: Erro interno: allowNAArg deve ser TRUE/FALSE

source: i[%d] is %d which is out of range [1,nrow=%d]
pt_br: i[%d] é %d, que está fora do intervalo [1,nrow=%d]

source: Item %d of i is %d and item %d is %d. Cannot mix positives and negatives.
pt_br: Item %d de i é %d e o item %d é %d. Não é possível misturar positivos e negativos.

source: Item %d of i is %d and item %d is NA. Cannot mix negatives and NA.
pt_br: Item %d de i é %d e o item %d é NA. Não é possível misturar NA e negativos.

source: Item %d of i is %d but there are only %d rows. Ignoring this and %d more like it out of %d.
pt_br: Item %d de i é %d, mas há apenas %d linhas. Ignorando este e %d mais como ele, de um total de %d.

source: Item %d of i is %d which removes that item but that has occurred before. Ignoring this dup and %d other dups.
pt_br: Item %d de i é %d o que remove esse item, mas isso já ocorreu antes. Ignorando esta duplicata e %d outras duplicatas.

source: Column %d is NULL; malformed data.table.
pt_br: Coluna %d é NULL; data.table malformada.

source: Column %d ['%s'] is a data.frame or data.table; malformed data.table.
pt_br: Coluna %d ['%s'] é um data.frame ou uma data.table; data.table malformada.

source: Column %d ['%s'] is length %d but column 1 is length %d; malformed data.table.
pt_br: Coluna %d ['%s'] tem comprimento %d, mas a coluna 1 tem comprimento %d; data.table malformada.

source: Item %d of cols is %d which is outside the range [1,ncol(x)=%d]
pt_br: Item %d de cols é %d, que está fora do intervalo [1, ncol(x)=%d]

source: Internal error: NULL can not be subset. It is invalid for a data.table to contain a NULL column.
pt_br: Erro interno: NULL não pode ser subconjunto. É inválido para uma data.table conter uma coluna NULL.

source: Internal error: CsubsetVector is internal-use-only but has received negatives, zeros or out-of-range
pt_br: Erro interno: CsubsetVector é de uso interno apenas, mas recebeu valores negativos, zeros ou fora do intervalo
