Repository: rffontenelle/r-datatable-pt_br
Catalog: */uniqlist.po
Languages: pt_br

source: Internal error: uniqlist has not been passed a list of columns
pt_br: Erro interno: uniqlist recebeu uma lista de colunas

source: Internal error: uniqlist has been passed a non-integer order
pt_br: Erro interno: uniqlist recebeu uma ordem não de inteiro

source: Internal error: uniqlist has been passed a length-0 order
pt_br: Erro interno: uniqlist recebeu uma ordem de comprimento 0

source: Internal error: uniqlist has been passed length(order)==%d but nrow==%d
pt_br: Erro interno: uniqlist recebeu length(order)==%d, mas nrow==%d

source: Type '%s' is not supported
pt_br: Tipo '%s' não é suportado

source: Input argument 'x' to 'uniqlengths' must be an integer vector
pt_br: Argumento de entrada 'x' para 'uniqlengths' deve ser um vetor de inteiros

source: Input argument 'n' to 'uniqlengths' must be an integer vector of length 1
pt_br: Argumento de entrada 'n' para 'uniqlengths' deve ser um vetor de inteiros de comprimento 1

source: cols must be an integer vector with length >= 1
pt_br: cols deve ser um vetor de inteiros com comprimento >= 1

source: Item %d of cols is %d which is outside the range [1,length(l)=%d]
pt_br: Item %d de cols é %d, que está fora do intervalo [1, length(l)=%d]

source: All elements to input list must be of same length. Element [%d] has length %<PRIu64> != length of first element = %<PRIu64>.
pt_br: Todos os elementos da lista de entrada devem ter o mesmo comprimento. Elemento [%d] tem comprimento %<PRIu64> != comprimento do primeiro elemento = %<PRIu64>.

source: Internal error: nestedid was not passed a list length 1 or more
pt_br: Erro interno: nestedid não recebeu uma lista com comprimento 1 ou maior

source: Internal error: nrows[%d]>0 but ngrps==0
pt_br: Erro interno: nrows[%d]>0, mas ngrps==0

source: Internal error: invalid value for 'mult'. please report to data.table issue tracker
pt_br: Erro interno: valor inválido para 'mult'. Por favor, reporte ao rastreador de problemas do data.table

source: x is not a logical vector
pt_br: x não é um vetor lógico

source: %s must be TRUE or FALSE
pt_br: %s deve ser TRUE ou FALSE
